{
    "file-description": "Used by generate-attribution in script/generate-attribution.sh",
    "@aws/language-server-runtimes": {
        "ignore": true
    },
    "@aws/lsp-codewhisperer": {
        "ignore": true
    },
    "@aws/lsp-core": {
        "ignore": true
    },
    "caniuse-lite": {
        "ignore": true
    },
    "node": {
        "name": "Node.js",
        "version": "24.7.0",
        "url": "https://github.com/nodejs/node",
        "license": "MIT",
        "licenseText": "Node.js is licensed for use as follows:\n\n\"\"\"\nCopyright Node.js contributors. All rights reserved.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to\ndeal in the Software without restriction, including without limitation the\nrights to use, copy, modify, merge, publish, distribute, sublicense, and/or\nsell copies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\nFROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS\nIN THE SOFTWARE.\n\"\"\"\n\nThis license applies to parts of Node.js originating from the\nhttps://github.com/joyent/node repository:\n\n\"\"\"\nCopyright Joyent, Inc. and other Node contributors. All rights reserved.\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to\ndeal in the Software without restriction, including without limitation the\nrights to use, copy, modify, merge, publish, distribute, sublicense, and/or\nsell copies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\nFROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS\nIN THE SOFTWARE.\n\"\"\"\n\nThe Node.js license applies to all parts of Node.js that are not externally\nmaintained libraries.\n\nThe externally maintained libraries used by Node.js are:\n\n- Acorn, located at deps/acorn, is licensed as follows:\n  \"\"\"\n    MIT License\n\n    Copyright (C) 2012-2022 by various contributors (see AUTHORS)\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy\n    of this software and associated documentation files (the \"Software\"), to deal\n    in the Software without restriction, including without limitation the rights\n    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n    copies of the Software, and to permit persons to whom the Software is\n    furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in\n    all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\n    THE SOFTWARE.\n  \"\"\"\n\n- c-ares, located at deps/cares, is licensed as follows:\n  \"\"\"\n    MIT License\n\n    Copyright (c) 1998 Massachusetts Institute of Technology\n    Copyright (c) 2007 - 2023 Daniel Stenberg with many contributors, see AUTHORS\n    file.\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy of\n    this software and associated documentation files (the \"Software\"), to deal in\n    the Software without restriction, including without limitation the rights to\n    use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of\n    the Software, and to permit persons to whom the Software is furnished to do so,\n    subject to the following conditions:\n\n    The above copyright notice and this permission notice (including the next\n    paragraph) shall be included in all copies or substantial portions of the\n    Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n    SOFTWARE.\n  \"\"\"\n\n- cjs-module-lexer, located at deps/cjs-module-lexer, is licensed as follows:\n  \"\"\"\n    MIT License\n    -----------\n\n    Copyright (C) 2018-2020 Guy Bedford\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n  \"\"\"\n\n- ittapi, located at deps/v8/third_party/ittapi, is licensed as follows:\n  \"\"\"\n    Copyright (c) 2019 Intel Corporation. All rights reserved.\n\n    Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n    1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n  \"\"\"\n\n- amaro, located at deps/amaro, is licensed as follows:\n  \"\"\"\n    MIT License\n\n    Copyright (c) Marco Ippolito and Amaro contributors\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy\n    of this software and associated documentation files (the \"Software\"), to deal\n    in the Software without restriction, including without limitation the rights\n    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n    copies of the Software, and to permit persons to whom the Software is\n    furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in all\n    copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n    SOFTWARE.\n  \"\"\"\n\n- swc, located at deps/amaro/dist, is licensed as follows:\n  \"\"\"\n                                  Apache License\n                            Version 2.0, January 2004\n                         http://www.apache.org/licenses/\n\n    TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n    1. Definitions.\n\n       \"License\" shall mean the terms and conditions for use, reproduction,\n       and distribution as defined by Sections 1 through 9 of this document.\n\n       \"Licensor\" shall mean the copyright owner or entity authorized by\n       the copyright owner that is granting the License.\n\n       \"Legal Entity\" shall mean the union of the acting entity and all\n       other entities that control, are controlled by, or are under common\n       control with that entity. For the purposes of this definition,\n       \"control\" means (i) the power, direct or indirect, to cause the\n       direction or management of such entity, whether by contract or\n       otherwise, or (ii) ownership of fifty percent (50%) or more of the\n       outstanding shares, or (iii) beneficial ownership of such entity.\n\n       \"You\" (or \"Your\") shall mean an individual or Legal Entity\n       exercising permissions granted by this License.\n\n       \"Source\" form shall mean the preferred form for making modifications,\n       including but not limited to software source code, documentation\n       source, and configuration files.\n\n       \"Object\" form shall mean any form resulting from mechanical\n       transformation or translation of a Source form, including but\n       not limited to compiled object code, generated documentation,\n       and conversions to other media types.\n\n       \"Work\" shall mean the work of authorship, whether in Source or\n       Object form, made available under the License, as indicated by a\n       copyright notice that is included in or attached to the work\n       (an example is provided in the Appendix below).\n\n       \"Derivative Works\" shall mean any work, whether in Source or Object\n       form, that is based on (or derived from) the Work and for which the\n       editorial revisions, annotations, elaborations, or other modifications\n       represent, as a whole, an original work of authorship. For the purposes\n       of this License, Derivative Works shall not include works that remain\n       separable from, or merely link (or bind by name) to the interfaces of,\n       the Work and Derivative Works thereof.\n\n       \"Contribution\" shall mean any work of authorship, including\n       the original version of the Work and any modifications or additions\n       to that Work or Derivative Works thereof, that is intentionally\n       submitted to Licensor for inclusion in the Work by the copyright owner\n       or by an individual or Legal Entity authorized to submit on behalf of\n       the copyright owner. For the purposes of this definition, \"submitted\"\n       means any form of electronic, verbal, or written communication sent\n       to the Licensor or its representatives, including but not limited to\n       communication on electronic mailing lists, source code control systems,\n       and issue tracking systems that are managed by, or on behalf of, the\n       Licensor for the purpose of discussing and improving the Work, but\n       excluding communication that is conspicuously marked or otherwise\n       designated in writing by the copyright owner as \"Not a Contribution.\"\n\n       \"Contributor\" shall mean Licensor and any individual or Legal Entity\n       on behalf of whom a Contribution has been received by Licensor and\n       subsequently incorporated within the Work.\n\n    2. Grant of Copyright License. Subject to the terms and conditions of\n       this License, each Contributor hereby grants to You a perpetual,\n       worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n       copyright license to reproduce, prepare Derivative Works of,\n       publicly display, publicly perform, sublicense, and distribute the\n       Work and such Derivative Works in Source or Object form.\n\n    3. Grant of Patent License. Subject to the terms and conditions of\n       this License, each Contributor hereby grants to You a perpetual,\n       worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n       (except as stated in this section) patent license to make, have made,\n       use, offer to sell, sell, import, and otherwise transfer the Work,\n       where such license applies only to those patent claims licensable\n       by such Contributor that are necessarily infringed by their\n       Contribution(s) alone or by combination of their Contribution(s)\n       with the Work to which such Contribution(s) was submitted. If You\n       institute patent litigation against any entity (including a\n       cross-claim or counterclaim in a lawsuit) alleging that the Work\n       or a Contribution incorporated within the Work constitutes direct\n       or contributory patent infringement, then any patent licenses\n       granted to You under this License for that Work shall terminate\n       as of the date such litigation is filed.\n\n    4. Redistribution. You may reproduce and distribute copies of the\n       Work or Derivative Works thereof in any medium, with or without\n       modifications, and in Source or Object form, provided that You\n       meet the following conditions:\n\n       (a) You must give any other recipients of the Work or\n           Derivative Works a copy of this License; and\n\n       (b) You must cause any modified files to carry prominent notices\n           stating that You changed the files; and\n\n       (c) You must retain, in the Source form of any Derivative Works\n           that You distribute, all copyright, patent, trademark, and\n           attribution notices from the Source form of the Work,\n           excluding those notices that do not pertain to any part of\n           the Derivative Works; and\n\n       (d) If the Work includes a \"NOTICE\" text file as part of its\n           distribution, then any Derivative Works that You distribute must\n           include a readable copy of the attribution notices contained\n           within such NOTICE file, excluding those notices that do not\n           pertain to any part of the Derivative Works, in at least one\n           of the following places: within a NOTICE text file distributed\n           as part of the Derivative Works; within the Source form or\n           documentation, if provided along with the Derivative Works; or,\n           within a display generated by the Derivative Works, if and\n           wherever such third-party notices normally appear. The contents\n           of the NOTICE file are for informational purposes only and\n           do not modify the License. You may add Your own attribution\n           notices within Derivative Works that You distribute, alongside\n           or as an addendum to the NOTICE text from the Work, provided\n           that such additional attribution notices cannot be construed\n           as modifying the License.\n\n       You may add Your own copyright statement to Your modifications and\n       may provide additional or different license terms and conditions\n       for use, reproduction, or distribution of Your modifications, or\n       for any such Derivative Works as a whole, provided Your use,\n       reproduction, and distribution of the Work otherwise complies with\n       the conditions stated in this License.\n\n    5. Submission of Contributions. Unless You explicitly state otherwise,\n       any Contribution intentionally submitted for inclusion in the Work\n       by You to the Licensor shall be under the terms and conditions of\n       this License, without any additional terms or conditions.\n       Notwithstanding the above, nothing herein shall supersede or modify\n       the terms of any separate license agreement you may have executed\n       with Licensor regarding such Contributions.\n\n    6. Trademarks. This License does not grant permission to use the trade\n       names, trademarks, service marks, or product names of the Licensor,\n       except as required for reasonable and customary use in describing the\n       origin of the Work and reproducing the content of the NOTICE file.\n\n    7. Disclaimer of Warranty. Unless required by applicable law or\n       agreed to in writing, Licensor provides the Work (and each\n       Contributor provides its Contributions) on an \"AS IS\" BASIS,\n       WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n       implied, including, without limitation, any warranties or conditions\n       of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n       PARTICULAR PURPOSE. You are solely responsible for determining the\n       appropriateness of using or redistributing the Work and assume any\n       risks associated with Your exercise of permissions under this License.\n\n    8. Limitation of Liability. In no event and under no legal theory,\n       whether in tort (including negligence), contract, or otherwise,\n       unless required by applicable law (such as deliberate and grossly\n       negligent acts) or agreed to in writing, shall any Contributor be\n       liable to You for damages, including any direct, indirect, special,\n       incidental, or consequential damages of any character arising as a\n       result of this License or out of the use or inability to use the\n       Work (including but not limited to damages for loss of goodwill,\n       work stoppage, computer failure or malfunction, or any and all\n       other commercial damages or losses), even if such Contributor\n       has been advised of the possibility of such damages.\n\n    9. Accepting Warranty or Additional Liability. While redistributing\n       the Work or Derivative Works thereof, You may choose to offer,\n       and charge a fee for, acceptance of support, warranty, indemnity,\n       or other liability obligations and/or rights consistent with this\n       License. However, in accepting such obligations, You may act only\n       on Your own behalf and on Your sole responsibility, not on behalf\n       of any other Contributor, and only if You agree to indemnify,\n       defend, and hold each Contributor harmless for any liability\n       incurred by, or claims asserted against, such Contributor by reason\n       of your accepting any such warranty or additional liability.\n\n    END OF TERMS AND CONDITIONS\n\n    APPENDIX: How to apply the Apache License to your work.\n\n       To apply the Apache License to your work, attach the following\n       boilerplate notice, with the fields enclosed by brackets \"[]\"\n       replaced with your own identifying information. (Don't include\n       the brackets!)  The text should be enclosed in the appropriate\n       comment syntax for the file format. We also recommend that a\n       file or class name and description of purpose be included on the\n       same \"printed page\" as the copyright notice for easier\n       identification within third-party archives.\n\n    Copyright 2024 SWC contributors.\n\n    Licensed under the Apache License, Version 2.0 (the \"License\");\n    you may not use this file except in compliance with the License.\n    You may obtain a copy of the License at\n\n    \thttp://www.apache.org/licenses/LICENSE-2.0\n\n    Unless required by applicable law or agreed to in writing, software\n    distributed under the License is distributed on an \"AS IS\" BASIS,\n    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n    See the License for the specific language governing permissions and\n    limitations under the License.\n  \"\"\"\n\n- ICU, located at deps/icu-small, is licensed as follows:\n  \"\"\"\n    UNICODE LICENSE V3\n\n    COPYRIGHT AND PERMISSION NOTICE\n\n    Copyright © 2016-2025 Unicode, Inc.\n\n    NOTICE TO USER: Carefully read the following legal agreement. BY\n    DOWNLOADING, INSTALLING, COPYING OR OTHERWISE USING DATA FILES, AND/OR\n    SOFTWARE, YOU UNEQUIVOCALLY ACCEPT, AND AGREE TO BE BOUND BY, ALL OF THE\n    TERMS AND CONDITIONS OF THIS AGREEMENT. IF YOU DO NOT AGREE, DO NOT\n    DOWNLOAD, INSTALL, COPY, DISTRIBUTE OR USE THE DATA FILES OR SOFTWARE.\n\n    Permission is hereby granted, free of charge, to any person obtaining a\n    copy of data files and any associated documentation (the \"Data Files\") or\n    software and any associated documentation (the \"Software\") to deal in the\n    Data Files or Software without restriction, including without limitation\n    the rights to use, copy, modify, merge, publish, distribute, and/or sell\n    copies of the Data Files or Software, and to permit persons to whom the\n    Data Files or Software are furnished to do so, provided that either (a)\n    this copyright and permission notice appear with all copies of the Data\n    Files or Software, or (b) this copyright and permission notice appear in\n    associated Documentation.\n\n    THE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY\n    KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n    MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF\n    THIRD PARTY RIGHTS.\n\n    IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS NOTICE\n    BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES,\n    OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,\n    WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION,\n    ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THE DATA\n    FILES OR SOFTWARE.\n\n    Except as contained in this notice, the name of a copyright holder shall\n    not be used in advertising or otherwise to promote the sale, use or other\n    dealings in these Data Files or Software without prior written\n    authorization of the copyright holder.\n\n    SPDX-License-Identifier: Unicode-3.0\n\n    ----------------------------------------------------------------------\n\n    Third-Party Software Licenses\n\n    This section contains third-party software notices and/or additional\n    terms for licensed third-party software components included within ICU\n    libraries.\n\n    ----------------------------------------------------------------------\n\n    ICU License - ICU 1.8.1 to ICU 57.1\n\n    COPYRIGHT AND PERMISSION NOTICE\n\n    Copyright (c) 1995-2016 International Business Machines Corporation and others\n    All rights reserved.\n\n    Permission is hereby granted, free of charge, to any person obtaining\n    a copy of this software and associated documentation files (the\n    \"Software\"), to deal in the Software without restriction, including\n    without limitation the rights to use, copy, modify, merge, publish,\n    distribute, and/or sell copies of the Software, and to permit persons\n    to whom the Software is furnished to do so, provided that the above\n    copyright notice(s) and this permission notice appear in all copies of\n    the Software and that both the above copyright notice(s) and this\n    permission notice appear in supporting documentation.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\n    EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n    MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT\n    OF THIRD PARTY RIGHTS. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR\n    HOLDERS INCLUDED IN THIS NOTICE BE LIABLE FOR ANY CLAIM, OR ANY\n    SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES, OR ANY DAMAGES WHATSOEVER\n    RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF\n    CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN\n    CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n\n    Except as contained in this notice, the name of a copyright holder\n    shall not be used in advertising or otherwise to promote the sale, use\n    or other dealings in this Software without prior written authorization\n    of the copyright holder.\n\n    All trademarks and registered trademarks mentioned herein are the\n    property of their respective owners.\n\n    ----------------------------------------------------------------------\n\n    Chinese/Japanese Word Break Dictionary Data (cjdict.txt)\n\n     #     The Google Chrome software developed by Google is licensed under\n     # the BSD license. Other software included in this distribution is\n     # provided under other licenses, as set forth below.\n     #\n     #  The BSD License\n     #  http://opensource.org/licenses/bsd-license.php\n     #  Copyright (C) 2006-2008, Google Inc.\n     #\n     #  All rights reserved.\n     #\n     #  Redistribution and use in source and binary forms, with or without\n     # modification, are permitted provided that the following conditions are met:\n     #\n     #  Redistributions of source code must retain the above copyright notice,\n     # this list of conditions and the following disclaimer.\n     #  Redistributions in binary form must reproduce the above\n     # copyright notice, this list of conditions and the following\n     # disclaimer in the documentation and/or other materials provided with\n     # the distribution.\n     #  Neither the name of  Google Inc. nor the names of its\n     # contributors may be used to endorse or promote products derived from\n     # this software without specific prior written permission.\n     #\n     #\n     #  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND\n     # CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES,\n     # INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n     # MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n     # DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE\n     # LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n     # CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\n     # SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\n     # BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\n     # LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\n     # NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\n     # SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n     #\n     #\n     #  The word list in cjdict.txt are generated by combining three word lists\n     # listed below with further processing for compound word breaking. The\n     # frequency is generated with an iterative training against Google web\n     # corpora.\n     #\n     #  * Libtabe (Chinese)\n     #    - https://sourceforge.net/project/?group_id=1519\n     #    - Its license terms and conditions are shown below.\n     #\n     #  * IPADIC (Japanese)\n     #    - http://chasen.aist-nara.ac.jp/chasen/distribution.html\n     #    - Its license terms and conditions are shown below.\n     #\n     #  ---------COPYING.libtabe ---- BEGIN--------------------\n     #\n     #  /*\n     #   * Copyright (c) 1999 TaBE Project.\n     #   * Copyright (c) 1999 Pai-Hsiang Hsiao.\n     #   * All rights reserved.\n     #   *\n     #   * Redistribution and use in source and binary forms, with or without\n     #   * modification, are permitted provided that the following conditions\n     #   * are met:\n     #   *\n     #   * . Redistributions of source code must retain the above copyright\n     #   *   notice, this list of conditions and the following disclaimer.\n     #   * . Redistributions in binary form must reproduce the above copyright\n     #   *   notice, this list of conditions and the following disclaimer in\n     #   *   the documentation and/or other materials provided with the\n     #   *   distribution.\n     #   * . Neither the name of the TaBE Project nor the names of its\n     #   *   contributors may be used to endorse or promote products derived\n     #   *   from this software without specific prior written permission.\n     #   *\n     #   * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n     #   * \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n     #   * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS\n     #   * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE\n     #   * REGENTS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\n     #   * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n     #   * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\n     #   * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n     #   * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\n     #   * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n     #   * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED\n     #   * OF THE POSSIBILITY OF SUCH DAMAGE.\n     #   */\n     #\n     #  /*\n     #   * Copyright (c) 1999 Computer Systems and Communication Lab,\n     #   *                    Institute of Information Science, Academia\n     #       *                    Sinica. All rights reserved.\n     #   *\n     #   * Redistribution and use in source and binary forms, with or without\n     #   * modification, are permitted provided that the following conditions\n     #   * are met:\n     #   *\n     #   * . Redistributions of source code must retain the above copyright\n     #   *   notice, this list of conditions and the following disclaimer.\n     #   * . Redistributions in binary form must reproduce the above copyright\n     #   *   notice, this list of conditions and the following disclaimer in\n     #   *   the documentation and/or other materials provided with the\n     #   *   distribution.\n     #   * . Neither the name of the Computer Systems and Communication Lab\n     #   *   nor the names of its contributors may be used to endorse or\n     #   *   promote products derived from this software without specific\n     #   *   prior written permission.\n     #   *\n     #   * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n     #   * \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n     #   * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS\n     #   * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE\n     #   * REGENTS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\n     #   * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n     #   * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\n     #   * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n     #   * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\n     #   * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n     #   * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED\n     #   * OF THE POSSIBILITY OF SUCH DAMAGE.\n     #   */\n     #\n     #  Copyright 1996 Chih-Hao Tsai @ Beckman Institute,\n     #      University of Illinois\n     #  c-tsai4@uiuc.edu  http://casper.beckman.uiuc.edu/~c-tsai4\n     #\n     #  ---------------COPYING.libtabe-----END--------------------------------\n     #\n     #\n     #  ---------------COPYING.ipadic-----BEGIN-------------------------------\n     #\n     #  Copyright 2000, 2001, 2002, 2003 Nara Institute of Science\n     #  and Technology.  All Rights Reserved.\n     #\n     #  Use, reproduction, and distribution of this software is permitted.\n     #  Any copy of this software, whether in its original form or modified,\n     #  must include both the above copyright notice and the following\n     #  paragraphs.\n     #\n     #  Nara Institute of Science and Technology (NAIST),\n     #  the copyright holders, disclaims all warranties with regard to this\n     #  software, including all implied warranties of merchantability and\n     #  fitness, in no event shall NAIST be liable for\n     #  any special, indirect or consequential damages or any damages\n     #  whatsoever resulting from loss of use, data or profits, whether in an\n     #  action of contract, negligence or other tortuous action, arising out\n     #  of or in connection with the use or performance of this software.\n     #\n     #  A large portion of the dictionary entries\n     #  originate from ICOT Free Software.  The following conditions for ICOT\n     #  Free Software applies to the current dictionary as well.\n     #\n     #  Each User may also freely distribute the Program, whether in its\n     #  original form or modified, to any third party or parties, PROVIDED\n     #  that the provisions of Section 3 (\"NO WARRANTY\") will ALWAYS appear\n     #  on, or be attached to, the Program, which is distributed substantially\n     #  in the same form as set out herein and that such intended\n     #  distribution, if actually made, will neither violate or otherwise\n     #  contravene any of the laws and regulations of the countries having\n     #  jurisdiction over the User or the intended distribution itself.\n     #\n     #  NO WARRANTY\n     #\n     #  The program was produced on an experimental basis in the course of the\n     #  research and development conducted during the project and is provided\n     #  to users as so produced on an experimental basis.  Accordingly, the\n     #  program is provided without any warranty whatsoever, whether express,\n     #  implied, statutory or otherwise.  The term \"warranty\" used herein\n     #  includes, but is not limited to, any warranty of the quality,\n     #  performance, merchantability and fitness for a particular purpose of\n     #  the program and the nonexistence of any infringement or violation of\n     #  any right of any third party.\n     #\n     #  Each user of the program will agree and understand, and be deemed to\n     #  have agreed and understood, that there is no warranty whatsoever for\n     #  the program and, accordingly, the entire risk arising from or\n     #  otherwise connected with the program is assumed by the user.\n     #\n     #  Therefore, neither ICOT, the copyright holder, or any other\n     #  organization that participated in or was otherwise related to the\n     #  development of the program and their respective officials, directors,\n     #  officers and other employees shall be held liable for any and all\n     #  damages, including, without limitation, general, special, incidental\n     #  and consequential damages, arising out of or otherwise in connection\n     #  with the use or inability to use the program or any product, material\n     #  or result produced or otherwise obtained by using the program,\n     #  regardless of whether they have been advised of, or otherwise had\n     #  knowledge of, the possibility of such damages at any time during the\n     #  project or thereafter.  Each user will be deemed to have agreed to the\n     #  foregoing by his or her commencement of use of the program.  The term\n     #  \"use\" as used herein includes, but is not limited to, the use,\n     #  modification, copying and distribution of the program and the\n     #  production of secondary products from the program.\n     #\n     #  In the case where the program, whether in its original form or\n     #  modified, was distributed or delivered to or received by a user from\n     #  any person, organization or entity other than ICOT, unless it makes or\n     #  grants independently of ICOT any specific warranty to the user in\n     #  writing, such person, organization or entity, will also be exempted\n     #  from and not be held liable to the user for any such damages as noted\n     #  above as far as the program is concerned.\n     #\n     #  ---------------COPYING.ipadic-----END----------------------------------\n\n    ----------------------------------------------------------------------\n\n    Lao Word Break Dictionary Data (laodict.txt)\n\n     # Copyright (C) 2016 and later: Unicode, Inc. and others.\n     # License & terms of use: http://www.unicode.org/copyright.html\n     # Copyright (c) 2015 International Business Machines Corporation\n     # and others. All Rights Reserved.\n     #\n     # Project: https://github.com/rober42539/lao-dictionary\n     # Dictionary: https://github.com/rober42539/lao-dictionary/laodict.txt\n     # License: https://github.com/rober42539/lao-dictionary/LICENSE.txt\n     #          (copied below)\n     #\n     # This file is derived from the above dictionary version of Nov 22, 2020\n     #  ----------------------------------------------------------------------\n     #  Copyright (C) 2013 Brian Eugene Wilson, Robert Martin Campbell.\n     #  All rights reserved.\n     #\n     #  Redistribution and use in source and binary forms, with or without\n     #  modification, are permitted provided that the following conditions are met:\n     #\n     #  Redistributions of source code must retain the above copyright notice, this\n     #  list of conditions and the following disclaimer. Redistributions in binary\n     #  form must reproduce the above copyright notice, this list of conditions and\n     #  the following disclaimer in the documentation and/or other materials\n     #  provided with the distribution.\n     #\n     # THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n     # \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n     # LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS\n     # FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE\n     # COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,\n     # INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n     # (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\n     # SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n     # HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\n     # STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n     # ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED\n     # OF THE POSSIBILITY OF SUCH DAMAGE.\n     #  --------------------------------------------------------------------------\n\n    ----------------------------------------------------------------------\n\n    Burmese Word Break Dictionary Data (burmesedict.txt)\n\n     #  Copyright (c) 2014 International Business Machines Corporation\n     #  and others. All Rights Reserved.\n     #\n     #  This list is part of a project hosted at:\n     #    github.com/kanyawtech/myanmar-karen-word-lists\n     #\n     #  --------------------------------------------------------------------------\n     #  Copyright (c) 2013, LeRoy Benjamin Sharon\n     #  All rights reserved.\n     #\n     #  Redistribution and use in source and binary forms, with or without\n     #  modification, are permitted provided that the following conditions\n     #  are met: Redistributions of source code must retain the above\n     #  copyright notice, this list of conditions and the following\n     #  disclaimer.  Redistributions in binary form must reproduce the\n     #  above copyright notice, this list of conditions and the following\n     #  disclaimer in the documentation and/or other materials provided\n     #  with the distribution.\n     #\n     #    Neither the name Myanmar Karen Word Lists, nor the names of its\n     #    contributors may be used to endorse or promote products derived\n     #    from this software without specific prior written permission.\n     #\n     #  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND\n     #  CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES,\n     #  INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n     #  MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n     #  DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS\n     #  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\n     #  EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED\n     #  TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n     #  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\n     #  ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR\n     #  TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF\n     #  THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\n     #  SUCH DAMAGE.\n     #  --------------------------------------------------------------------------\n\n    ----------------------------------------------------------------------\n\n    Time Zone Database\n\n      ICU uses the public domain data and code derived from Time Zone\n    Database for its time zone support. The ownership of the TZ database\n    is explained in BCP 175: Procedure for Maintaining the Time Zone\n    Database section 7.\n\n     # 7.  Database Ownership\n     #\n     #    The TZ database itself is not an IETF Contribution or an IETF\n     #    document.  Rather it is a pre-existing and regularly updated work\n     #    that is in the public domain, and is intended to remain in the\n     #    public domain.  Therefore, BCPs 78 [RFC5378] and 79 [RFC3979] do\n     #    not apply to the TZ Database or contributions that individuals make\n     #    to it.  Should any claims be made and substantiated against the TZ\n     #    Database, the organization that is providing the IANA\n     #    Considerations defined in this RFC, under the memorandum of\n     #    understanding with the IETF, currently ICANN, may act in accordance\n     #    with all competent court orders.  No ownership claims will be made\n     #    by ICANN or the IETF Trust on the database or the code.  Any person\n     #    making a contribution to the database or code waives all rights to\n     #    future claims in that contribution or in the TZ Database.\n\n    ----------------------------------------------------------------------\n\n    Google double-conversion\n\n    Copyright 2006-2011, the V8 project authors. All rights reserved.\n    Redistribution and use in source and binary forms, with or without\n    modification, are permitted provided that the following conditions are\n    met:\n\n        * Redistributions of source code must retain the above copyright\n          notice, this list of conditions and the following disclaimer.\n        * Redistributions in binary form must reproduce the above\n          copyright notice, this list of conditions and the following\n          disclaimer in the documentation and/or other materials provided\n          with the distribution.\n        * Neither the name of Google Inc. nor the names of its\n          contributors may be used to endorse or promote products derived\n          from this software without specific prior written permission.\n\n    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n    \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n    LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n    A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n    OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n    LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n    DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n    THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n    ----------------------------------------------------------------------\n\n    JSON parsing library (nlohmann/json)\n\n    File: vendor/json/upstream/single_include/nlohmann/json.hpp (only for ICU4C)\n\n    MIT License\n\n    Copyright (c) 2013-2022 Niels Lohmann\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy\n    of this software and associated documentation files (the \"Software\"), to deal\n    in the Software without restriction, including without limitation the rights\n    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n    copies of the Software, and to permit persons to whom the Software is\n    furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in all\n    copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n    SOFTWARE.\n\n    ----------------------------------------------------------------------\n\n    File: aclocal.m4 (only for ICU4C)\n    Section: pkg.m4 - Macros to locate and utilise pkg-config.\n\n    Copyright © 2004 Scott James Remnant .\n    Copyright © 2012-2015 Dan Nicholson\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful, but\n    WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU\n    General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program; if not, write to the Free Software\n    Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA\n    02111-1307, USA.\n\n    As a special exception to the GNU General Public License, if you\n    distribute this file as part of a program that contains a\n    configuration script generated by Autoconf, you may include it under\n    the same distribution terms that you use for the rest of that\n    program.\n\n    (The condition for the exception is fulfilled because\n    ICU4C includes a configuration script generated by Autoconf,\n    namely the `configure` script.)\n\n    ----------------------------------------------------------------------\n\n    File: config.guess (only for ICU4C)\n\n    This file is free software; you can redistribute it and/or modify it\n    under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful, but\n    WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n    General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program; if not, see .\n\n    As a special exception to the GNU General Public License, if you\n    distribute this file as part of a program that contains a\n    configuration script generated by Autoconf, you may include it under\n    the same distribution terms that you use for the rest of that\n    program.  This Exception is an additional permission under section 7\n    of the GNU General Public License, version 3 (\"GPLv3\").\n\n    (The condition for the exception is fulfilled because\n    ICU4C includes a configuration script generated by Autoconf,\n    namely the `configure` script.)\n\n    ----------------------------------------------------------------------\n\n    File: install-sh (only for ICU4C)\n\n    Copyright 1991 by the Massachusetts Institute of Technology\n\n    Permission to use, copy, modify, distribute, and sell this software and its\n    documentation for any purpose is hereby granted without fee, provided that\n    the above copyright notice appear in all copies and that both that\n    copyright notice and this permission notice appear in supporting\n    documentation, and that the name of M.I.T. not be used in advertising or\n    publicity pertaining to distribution of the software without specific,\n    written prior permission.  M.I.T. makes no representations about the\n    suitability of this software for any purpose.  It is provided \"as is\"\n    without express or implied warranty.\n  \"\"\"\n\n- libuv, located at deps/uv, is licensed as follows:\n  \"\"\"\n    Copyright (c) 2015-present libuv project contributors.\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy\n    of this software and associated documentation files (the \"Software\"), to\n    deal in the Software without restriction, including without limitation the\n    rights to use, copy, modify, merge, publish, distribute, sublicense, and/or\n    sell copies of the Software, and to permit persons to whom the Software is\n    furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in\n    all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\n    FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS\n    IN THE SOFTWARE.\n    This license applies to parts of libuv originating from the\n    https://github.com/joyent/libuv repository:\n\n    ====\n\n    Copyright Joyent, Inc. and other Node contributors. All rights reserved.\n    Permission is hereby granted, free of charge, to any person obtaining a copy\n    of this software and associated documentation files (the \"Software\"), to\n    deal in the Software without restriction, including without limitation the\n    rights to use, copy, modify, merge, publish, distribute, sublicense, and/or\n    sell copies of the Software, and to permit persons to whom the Software is\n    furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in\n    all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\n    FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS\n    IN THE SOFTWARE.\n\n    ====\n\n    This license applies to all parts of libuv that are not externally\n    maintained libraries.\n\n    The externally maintained libraries used by libuv are:\n\n      - tree.h (from FreeBSD), copyright Niels Provos. Two clause BSD license.\n\n      - inet_pton and inet_ntop implementations, contained in src/inet.c, are\n        copyright the Internet Systems Consortium, Inc., and licensed under the ISC\n        license.\n  \"\"\"\n\n- llhttp, located at deps/llhttp, is licensed as follows:\n  \"\"\"\n    This software is licensed under the MIT License.\n\n    Copyright Fedor Indutny, 2018.\n\n    Permission is hereby granted, free of charge, to any person obtaining a\n    copy of this software and associated documentation files (the\n    \"Software\"), to deal in the Software without restriction, including\n    without limitation the rights to use, copy, modify, merge, publish,\n    distribute, sublicense, and/or sell copies of the Software, and to permit\n    persons to whom the Software is furnished to do so, subject to the\n    following conditions:\n\n    The above copyright notice and this permission notice shall be included\n    in all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\n    OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n    MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN\n    NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,\n    DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR\n    OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE\n    USE OR OTHER DEALINGS IN THE SOFTWARE.\n  \"\"\"\n\n- corepack, located at deps/corepack, is licensed as follows:\n  \"\"\"\n    **Copyright © Corepack contributors**\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n  \"\"\"\n\n- undici, located at deps/undici, is licensed as follows:\n  \"\"\"\n    MIT License\n\n    Copyright (c) Matteo Collina and Undici contributors\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy\n    of this software and associated documentation files (the \"Software\"), to deal\n    in the Software without restriction, including without limitation the rights\n    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n    copies of the Software, and to permit persons to whom the Software is\n    furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in all\n    copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n    SOFTWARE.\n  \"\"\"\n\n- postject, located at test/fixtures/postject-copy, is licensed as follows:\n  \"\"\"\n    Postject is licensed for use as follows:\n\n    \"\"\"\n    MIT License\n\n    Copyright (c) 2022 Postman, Inc\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy\n    of this software and associated documentation files (the \"Software\"), to deal\n    in the Software without restriction, including without limitation the rights\n    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n    copies of the Software, and to permit persons to whom the Software is\n    furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in all\n    copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n    SOFTWARE.\n    \"\"\"\n\n    The Postject license applies to all parts of Postject that are not externally\n    maintained libraries.\n\n    The externally maintained libraries used by Postject are:\n\n    - LIEF, located at vendor/LIEF, is licensed as follows:\n      \"\"\"\n                                         Apache License\n                                   Version 2.0, January 2004\n                                http://www.apache.org/licenses/\n\n           TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n           1. Definitions.\n\n              \"License\" shall mean the terms and conditions for use, reproduction,\n              and distribution as defined by Sections 1 through 9 of this document.\n\n              \"Licensor\" shall mean the copyright owner or entity authorized by\n              the copyright owner that is granting the License.\n\n              \"Legal Entity\" shall mean the union of the acting entity and all\n              other entities that control, are controlled by, or are under common\n              control with that entity. For the purposes of this definition,\n              \"control\" means (i) the power, direct or indirect, to cause the\n              direction or management of such entity, whether by contract or\n              otherwise, or (ii) ownership of fifty percent (50%) or more of the\n              outstanding shares, or (iii) beneficial ownership of such entity.\n\n              \"You\" (or \"Your\") shall mean an individual or Legal Entity\n              exercising permissions granted by this License.\n\n              \"Source\" form shall mean the preferred form for making modifications,\n              including but not limited to software source code, documentation\n              source, and configuration files.\n\n              \"Object\" form shall mean any form resulting from mechanical\n              transformation or translation of a Source form, including but\n              not limited to compiled object code, generated documentation,\n              and conversions to other media types.\n\n              \"Work\" shall mean the work of authorship, whether in Source or\n              Object form, made available under the License, as indicated by a\n              copyright notice that is included in or attached to the work\n              (an example is provided in the Appendix below).\n\n              \"Derivative Works\" shall mean any work, whether in Source or Object\n              form, that is based on (or derived from) the Work and for which the\n              editorial revisions, annotations, elaborations, or other modifications\n              represent, as a whole, an original work of authorship. For the purposes\n              of this License, Derivative Works shall not include works that remain\n              separable from, or merely link (or bind by name) to the interfaces of,\n              the Work and Derivative Works thereof.\n\n              \"Contribution\" shall mean any work of authorship, including\n              the original version of the Work and any modifications or additions\n              to that Work or Derivative Works thereof, that is intentionally\n              submitted to Licensor for inclusion in the Work by the copyright owner\n              or by an individual or Legal Entity authorized to submit on behalf of\n              the copyright owner. For the purposes of this definition, \"submitted\"\n              means any form of electronic, verbal, or written communication sent\n              to the Licensor or its representatives, including but not limited to\n              communication on electronic mailing lists, source code control systems,\n              and issue tracking systems that are managed by, or on behalf of, the\n              Licensor for the purpose of discussing and improving the Work, but\n              excluding communication that is conspicuously marked or otherwise\n              designated in writing by the copyright owner as \"Not a Contribution.\"\n\n              \"Contributor\" shall mean Licensor and any individual or Legal Entity\n              on behalf of whom a Contribution has been received by Licensor and\n              subsequently incorporated within the Work.\n\n           2. Grant of Copyright License. Subject to the terms and conditions of\n              this License, each Contributor hereby grants to You a perpetual,\n              worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n              copyright license to reproduce, prepare Derivative Works of,\n              publicly display, publicly perform, sublicense, and distribute the\n              Work and such Derivative Works in Source or Object form.\n\n           3. Grant of Patent License. Subject to the terms and conditions of\n              this License, each Contributor hereby grants to You a perpetual,\n              worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n              (except as stated in this section) patent license to make, have made,\n              use, offer to sell, sell, import, and otherwise transfer the Work,\n              where such license applies only to those patent claims licensable\n              by such Contributor that are necessarily infringed by their\n              Contribution(s) alone or by combination of their Contribution(s)\n              with the Work to which such Contribution(s) was submitted. If You\n              institute patent litigation against any entity (including a\n              cross-claim or counterclaim in a lawsuit) alleging that the Work\n              or a Contribution incorporated within the Work constitutes direct\n              or contributory patent infringement, then any patent licenses\n              granted to You under this License for that Work shall terminate\n              as of the date such litigation is filed.\n\n           4. Redistribution. You may reproduce and distribute copies of the\n              Work or Derivative Works thereof in any medium, with or without\n              modifications, and in Source or Object form, provided that You\n              meet the following conditions:\n\n              (a) You must give any other recipients of the Work or\n                  Derivative Works a copy of this License; and\n\n              (b) You must cause any modified files to carry prominent notices\n                  stating that You changed the files; and\n\n              (c) You must retain, in the Source form of any Derivative Works\n                  that You distribute, all copyright, patent, trademark, and\n                  attribution notices from the Source form of the Work,\n                  excluding those notices that do not pertain to any part of\n                  the Derivative Works; and\n\n              (d) If the Work includes a \"NOTICE\" text file as part of its\n                  distribution, then any Derivative Works that You distribute must\n                  include a readable copy of the attribution notices contained\n                  within such NOTICE file, excluding those notices that do not\n                  pertain to any part of the Derivative Works, in at least one\n                  of the following places: within a NOTICE text file distributed\n                  as part of the Derivative Works; within the Source form or\n                  documentation, if provided along with the Derivative Works; or,\n                  within a display generated by the Derivative Works, if and\n                  wherever such third-party notices normally appear. The contents\n                  of the NOTICE file are for informational purposes only and\n                  do not modify the License. You may add Your own attribution\n                  notices within Derivative Works that You distribute, alongside\n                  or as an addendum to the NOTICE text from the Work, provided\n                  that such additional attribution notices cannot be construed\n                  as modifying the License.\n\n              You may add Your own copyright statement to Your modifications and\n              may provide additional or different license terms and conditions\n              for use, reproduction, or distribution of Your modifications, or\n              for any such Derivative Works as a whole, provided Your use,\n              reproduction, and distribution of the Work otherwise complies with\n              the conditions stated in this License.\n\n           5. Submission of Contributions. Unless You explicitly state otherwise,\n              any Contribution intentionally submitted for inclusion in the Work\n              by You to the Licensor shall be under the terms and conditions of\n              this License, without any additional terms or conditions.\n              Notwithstanding the above, nothing herein shall supersede or modify\n              the terms of any separate license agreement you may have executed\n              with Licensor regarding such Contributions.\n\n           6. Trademarks. This License does not grant permission to use the trade\n              names, trademarks, service marks, or product names of the Licensor,\n              except as required for reasonable and customary use in describing the\n              origin of the Work and reproducing the content of the NOTICE file.\n\n           7. Disclaimer of Warranty. Unless required by applicable law or\n              agreed to in writing, Licensor provides the Work (and each\n              Contributor provides its Contributions) on an \"AS IS\" BASIS,\n              WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n              implied, including, without limitation, any warranties or conditions\n              of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n              PARTICULAR PURPOSE. You are solely responsible for determining the\n              appropriateness of using or redistributing the Work and assume any\n              risks associated with Your exercise of permissions under this License.\n\n           8. Limitation of Liability. In no event and under no legal theory,\n              whether in tort (including negligence), contract, or otherwise,\n              unless required by applicable law (such as deliberate and grossly\n              negligent acts) or agreed to in writing, shall any Contributor be\n              liable to You for damages, including any direct, indirect, special,\n              incidental, or consequential damages of any character arising as a\n              result of this License or out of the use or inability to use the\n              Work (including but not limited to damages for loss of goodwill,\n              work stoppage, computer failure or malfunction, or any and all\n              other commercial damages or losses), even if such Contributor\n              has been advised of the possibility of such damages.\n\n           9. Accepting Warranty or Additional Liability. While redistributing\n              the Work or Derivative Works thereof, You may choose to offer,\n              and charge a fee for, acceptance of support, warranty, indemnity,\n              or other liability obligations and/or rights consistent with this\n              License. However, in accepting such obligations, You may act only\n              on Your own behalf and on Your sole responsibility, not on behalf\n              of any other Contributor, and only if You agree to indemnify,\n              defend, and hold each Contributor harmless for any liability\n              incurred by, or claims asserted against, such Contributor by reason\n              of your accepting any such warranty or additional liability.\n\n           END OF TERMS AND CONDITIONS\n\n           APPENDIX: How to apply the Apache License to your work.\n\n              To apply the Apache License to your work, attach the following\n              boilerplate notice, with the fields enclosed by brackets \"{}\"\n              replaced with your own identifying information. (Don't include\n              the brackets!)  The text should be enclosed in the appropriate\n              comment syntax for the file format. We also recommend that a\n              file or class name and description of purpose be included on the\n              same \"printed page\" as the copyright notice for easier\n              identification within third-party archives.\n\n           Copyright 2017 - 2022 R. Thomas\n           Copyright 2017 - 2022 Quarkslab\n\n           Licensed under the Apache License, Version 2.0 (the \"License\");\n           you may not use this file except in compliance with the License.\n           You may obtain a copy of the License at\n\n               http://www.apache.org/licenses/LICENSE-2.0\n\n           Unless required by applicable law or agreed to in writing, software\n           distributed under the License is distributed on an \"AS IS\" BASIS,\n           WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n           See the License for the specific language governing permissions and\n           limitations under the License.\n      \"\"\"\n  \"\"\"\n\n- OpenSSL, located at deps/openssl, is licensed as follows:\n  \"\"\"\n                                     Apache License\n                               Version 2.0, January 2004\n                            https://www.apache.org/licenses/\n\n       TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n       1. Definitions.\n\n          \"License\" shall mean the terms and conditions for use, reproduction,\n          and distribution as defined by Sections 1 through 9 of this document.\n\n          \"Licensor\" shall mean the copyright owner or entity authorized by\n          the copyright owner that is granting the License.\n\n          \"Legal Entity\" shall mean the union of the acting entity and all\n          other entities that control, are controlled by, or are under common\n          control with that entity. For the purposes of this definition,\n          \"control\" means (i) the power, direct or indirect, to cause the\n          direction or management of such entity, whether by contract or\n          otherwise, or (ii) ownership of fifty percent (50%) or more of the\n          outstanding shares, or (iii) beneficial ownership of such entity.\n\n          \"You\" (or \"Your\") shall mean an individual or Legal Entity\n          exercising permissions granted by this License.\n\n          \"Source\" form shall mean the preferred form for making modifications,\n          including but not limited to software source code, documentation\n          source, and configuration files.\n\n          \"Object\" form shall mean any form resulting from mechanical\n          transformation or translation of a Source form, including but\n          not limited to compiled object code, generated documentation,\n          and conversions to other media types.\n\n          \"Work\" shall mean the work of authorship, whether in Source or\n          Object form, made available under the License, as indicated by a\n          copyright notice that is included in or attached to the work\n          (an example is provided in the Appendix below).\n\n          \"Derivative Works\" shall mean any work, whether in Source or Object\n          form, that is based on (or derived from) the Work and for which the\n          editorial revisions, annotations, elaborations, or other modifications\n          represent, as a whole, an original work of authorship. For the purposes\n          of this License, Derivative Works shall not include works that remain\n          separable from, or merely link (or bind by name) to the interfaces of,\n          the Work and Derivative Works thereof.\n\n          \"Contribution\" shall mean any work of authorship, including\n          the original version of the Work and any modifications or additions\n          to that Work or Derivative Works thereof, that is intentionally\n          submitted to Licensor for inclusion in the Work by the copyright owner\n          or by an individual or Legal Entity authorized to submit on behalf of\n          the copyright owner. For the purposes of this definition, \"submitted\"\n          means any form of electronic, verbal, or written communication sent\n          to the Licensor or its representatives, including but not limited to\n          communication on electronic mailing lists, source code control systems,\n          and issue tracking systems that are managed by, or on behalf of, the\n          Licensor for the purpose of discussing and improving the Work, but\n          excluding communication that is conspicuously marked or otherwise\n          designated in writing by the copyright owner as \"Not a Contribution.\"\n\n          \"Contributor\" shall mean Licensor and any individual or Legal Entity\n          on behalf of whom a Contribution has been received by Licensor and\n          subsequently incorporated within the Work.\n\n       2. Grant of Copyright License. Subject to the terms and conditions of\n          this License, each Contributor hereby grants to You a perpetual,\n          worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n          copyright license to reproduce, prepare Derivative Works of,\n          publicly display, publicly perform, sublicense, and distribute the\n          Work and such Derivative Works in Source or Object form.\n\n       3. Grant of Patent License. Subject to the terms and conditions of\n          this License, each Contributor hereby grants to You a perpetual,\n          worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n          (except as stated in this section) patent license to make, have made,\n          use, offer to sell, sell, import, and otherwise transfer the Work,\n          where such license applies only to those patent claims licensable\n          by such Contributor that are necessarily infringed by their\n          Contribution(s) alone or by combination of their Contribution(s)\n          with the Work to which such Contribution(s) was submitted. If You\n          institute patent litigation against any entity (including a\n          cross-claim or counterclaim in a lawsuit) alleging that the Work\n          or a Contribution incorporated within the Work constitutes direct\n          or contributory patent infringement, then any patent licenses\n          granted to You under this License for that Work shall terminate\n          as of the date such litigation is filed.\n\n       4. Redistribution. You may reproduce and distribute copies of the\n          Work or Derivative Works thereof in any medium, with or without\n          modifications, and in Source or Object form, provided that You\n          meet the following conditions:\n\n          (a) You must give any other recipients of the Work or\n              Derivative Works a copy of this License; and\n\n          (b) You must cause any modified files to carry prominent notices\n              stating that You changed the files; and\n\n          (c) You must retain, in the Source form of any Derivative Works\n              that You distribute, all copyright, patent, trademark, and\n              attribution notices from the Source form of the Work,\n              excluding those notices that do not pertain to any part of\n              the Derivative Works; and\n\n          (d) If the Work includes a \"NOTICE\" text file as part of its\n              distribution, then any Derivative Works that You distribute must\n              include a readable copy of the attribution notices contained\n              within such NOTICE file, excluding those notices that do not\n              pertain to any part of the Derivative Works, in at least one\n              of the following places: within a NOTICE text file distributed\n              as part of the Derivative Works; within the Source form or\n              documentation, if provided along with the Derivative Works; or,\n              within a display generated by the Derivative Works, if and\n              wherever such third-party notices normally appear. The contents\n              of the NOTICE file are for informational purposes only and\n              do not modify the License. You may add Your own attribution\n              notices within Derivative Works that You distribute, alongside\n              or as an addendum to the NOTICE text from the Work, provided\n              that such additional attribution notices cannot be construed\n              as modifying the License.\n\n          You may add Your own copyright statement to Your modifications and\n          may provide additional or different license terms and conditions\n          for use, reproduction, or distribution of Your modifications, or\n          for any such Derivative Works as a whole, provided Your use,\n          reproduction, and distribution of the Work otherwise complies with\n          the conditions stated in this License.\n\n       5. Submission of Contributions. Unless You explicitly state otherwise,\n          any Contribution intentionally submitted for inclusion in the Work\n          by You to the Licensor shall be under the terms and conditions of\n          this License, without any additional terms or conditions.\n          Notwithstanding the above, nothing herein shall supersede or modify\n          the terms of any separate license agreement you may have executed\n          with Licensor regarding such Contributions.\n\n       6. Trademarks. This License does not grant permission to use the trade\n          names, trademarks, service marks, or product names of the Licensor,\n          except as required for reasonable and customary use in describing the\n          origin of the Work and reproducing the content of the NOTICE file.\n\n       7. Disclaimer of Warranty. Unless required by applicable law or\n          agreed to in writing, Licensor provides the Work (and each\n          Contributor provides its Contributions) on an \"AS IS\" BASIS,\n          WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n          implied, including, without limitation, any warranties or conditions\n          of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n          PARTICULAR PURPOSE. You are solely responsible for determining the\n          appropriateness of using or redistributing the Work and assume any\n          risks associated with Your exercise of permissions under this License.\n\n       8. Limitation of Liability. In no event and under no legal theory,\n          whether in tort (including negligence), contract, or otherwise,\n          unless required by applicable law (such as deliberate and grossly\n          negligent acts) or agreed to in writing, shall any Contributor be\n          liable to You for damages, including any direct, indirect, special,\n          incidental, or consequential damages of any character arising as a\n          result of this License or out of the use or inability to use the\n          Work (including but not limited to damages for loss of goodwill,\n          work stoppage, computer failure or malfunction, or any and all\n          other commercial damages or losses), even if such Contributor\n          has been advised of the possibility of such damages.\n\n       9. Accepting Warranty or Additional Liability. While redistributing\n          the Work or Derivative Works thereof, You may choose to offer,\n          and charge a fee for, acceptance of support, warranty, indemnity,\n          or other liability obligations and/or rights consistent with this\n          License. However, in accepting such obligations, You may act only\n          on Your own behalf and on Your sole responsibility, not on behalf\n          of any other Contributor, and only if You agree to indemnify,\n          defend, and hold each Contributor harmless for any liability\n          incurred by, or claims asserted against, such Contributor by reason\n          of your accepting any such warranty or additional liability.\n\n       END OF TERMS AND CONDITIONS\n  \"\"\"\n\n- Punycode.js, located at lib/punycode.js, is licensed as follows:\n  \"\"\"\n    Copyright Mathias Bynens <https://mathiasbynens.be/>\n\n    Permission is hereby granted, free of charge, to any person obtaining\n    a copy of this software and associated documentation files (the\n    \"Software\"), to deal in the Software without restriction, including\n    without limitation the rights to use, copy, modify, merge, publish,\n    distribute, sublicense, and/or sell copies of the Software, and to\n    permit persons to whom the Software is furnished to do so, subject to\n    the following conditions:\n\n    The above copyright notice and this permission notice shall be\n    included in all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\n    EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n    MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n    NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE\n    LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\n    OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\n    WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n  \"\"\"\n\n- V8, located at deps/v8, is licensed as follows:\n  \"\"\"\n    This license applies to all parts of V8 that are not externally\n    maintained libraries.  The externally maintained libraries used by V8\n    are:\n\n      - PCRE test suite, located in\n        test/mjsunit/third_party/regexp-pcre/regexp-pcre.js.  This is based on the\n        test suite from PCRE-7.3, which is copyrighted by the University\n        of Cambridge and Google, Inc.  The copyright notice and license\n        are embedded in regexp-pcre.js.\n\n      - Layout tests, located in test/mjsunit/third_party/object-keys.  These are\n        based on layout tests from webkit.org which are copyrighted by\n        Apple Computer, Inc. and released under a 3-clause BSD license.\n\n      - Strongtalk assembler, the basis of the files assembler-arm-inl.h,\n        assembler-arm.cc, assembler-arm.h, assembler-ia32-inl.h,\n        assembler-ia32.cc, assembler-ia32.h, assembler-x64-inl.h,\n        assembler-x64.cc, assembler-x64.h, assembler.cc and assembler.h.\n        This code is copyrighted by Sun Microsystems Inc. and released\n        under a 3-clause BSD license.\n\n      - Valgrind client API header, located at third_party/valgrind/valgrind.h\n        This is released under the BSD license.\n\n      - The Wasm C/C++ API headers, located at third_party/wasm-api/wasm.{h,hh}\n        This is released under the Apache license. The API's upstream prototype\n        implementation also formed the basis of V8's implementation in\n        src/wasm/c-api.cc.\n\n    These libraries have their own licenses; we recommend you read them,\n    as their terms may differ from the terms below.\n\n    Further license information can be found in LICENSE files located in\n    sub-directories.\n\n    Copyright 2014, the V8 project authors. All rights reserved.\n    Redistribution and use in source and binary forms, with or without\n    modification, are permitted provided that the following conditions are\n    met:\n\n        * Redistributions of source code must retain the above copyright\n          notice, this list of conditions and the following disclaimer.\n        * Redistributions in binary form must reproduce the above\n          copyright notice, this list of conditions and the following\n          disclaimer in the documentation and/or other materials provided\n          with the distribution.\n        * Neither the name of Google Inc. nor the names of its\n          contributors may be used to endorse or promote products derived\n          from this software without specific prior written permission.\n\n    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n    \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n    LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n    A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n    OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n    LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n    DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n    THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n  \"\"\"\n\n- SipHash, located at deps/v8/src/third_party/siphash, is licensed as follows:\n  \"\"\"\n    SipHash reference C implementation\n\n    Copyright (c) 2016 Jean-Philippe Aumasson <jeanphilippe.aumasson@gmail.com>\n\n    To the extent possible under law, the author(s) have dedicated all\n    copyright and related and neighboring rights to this software to the public\n    domain worldwide. This software is distributed without any warranty.\n  \"\"\"\n\n- zlib, located at deps/zlib, is licensed as follows:\n  \"\"\"\n    zlib.h -- interface of the 'zlib' general purpose compression library\n    version 1.3.1, January 22nd, 2024\n\n    Copyright (C) 1995-2024 Jean-loup Gailly and Mark Adler\n\n    This software is provided 'as-is', without any express or implied\n    warranty.  In no event will the authors be held liable for any damages\n    arising from the use of this software.\n\n    Permission is granted to anyone to use this software for any purpose,\n    including commercial applications, and to alter it and redistribute it\n    freely, subject to the following restrictions:\n\n    1. The origin of this software must not be misrepresented; you must not\n    claim that you wrote the original software. If you use this software\n    in a product, an acknowledgment in the product documentation would be\n    appreciated but is not required.\n    2. Altered source versions must be plainly marked as such, and must not be\n    misrepresented as being the original software.\n    3. This notice may not be removed or altered from any source distribution.\n\n    Jean-loup Gailly        Mark Adler\n    jloup@gzip.org          madler@alumni.caltech.edu\n  \"\"\"\n\n- simdjson, located at deps/simdjson, is licensed as follows:\n  \"\"\"\n                                     Apache License\n                               Version 2.0, January 2004\n                            http://www.apache.org/licenses/\n\n       TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n       1. Definitions.\n\n          \"License\" shall mean the terms and conditions for use, reproduction,\n          and distribution as defined by Sections 1 through 9 of this document.\n\n          \"Licensor\" shall mean the copyright owner or entity authorized by\n          the copyright owner that is granting the License.\n\n          \"Legal Entity\" shall mean the union of the acting entity and all\n          other entities that control, are controlled by, or are under common\n          control with that entity. For the purposes of this definition,\n          \"control\" means (i) the power, direct or indirect, to cause the\n          direction or management of such entity, whether by contract or\n          otherwise, or (ii) ownership of fifty percent (50%) or more of the\n          outstanding shares, or (iii) beneficial ownership of such entity.\n\n          \"You\" (or \"Your\") shall mean an individual or Legal Entity\n          exercising permissions granted by this License.\n\n          \"Source\" form shall mean the preferred form for making modifications,\n          including but not limited to software source code, documentation\n          source, and configuration files.\n\n          \"Object\" form shall mean any form resulting from mechanical\n          transformation or translation of a Source form, including but\n          not limited to compiled object code, generated documentation,\n          and conversions to other media types.\n\n          \"Work\" shall mean the work of authorship, whether in Source or\n          Object form, made available under the License, as indicated by a\n          copyright notice that is included in or attached to the work\n          (an example is provided in the Appendix below).\n\n          \"Derivative Works\" shall mean any work, whether in Source or Object\n          form, that is based on (or derived from) the Work and for which the\n          editorial revisions, annotations, elaborations, or other modifications\n          represent, as a whole, an original work of authorship. For the purposes\n          of this License, Derivative Works shall not include works that remain\n          separable from, or merely link (or bind by name) to the interfaces of,\n          the Work and Derivative Works thereof.\n\n          \"Contribution\" shall mean any work of authorship, including\n          the original version of the Work and any modifications or additions\n          to that Work or Derivative Works thereof, that is intentionally\n          submitted to Licensor for inclusion in the Work by the copyright owner\n          or by an individual or Legal Entity authorized to submit on behalf of\n          the copyright owner. For the purposes of this definition, \"submitted\"\n          means any form of electronic, verbal, or written communication sent\n          to the Licensor or its representatives, including but not limited to\n          communication on electronic mailing lists, source code control systems,\n          and issue tracking systems that are managed by, or on behalf of, the\n          Licensor for the purpose of discussing and improving the Work, but\n          excluding communication that is conspicuously marked or otherwise\n          designated in writing by the copyright owner as \"Not a Contribution.\"\n\n          \"Contributor\" shall mean Licensor and any individual or Legal Entity\n          on behalf of whom a Contribution has been received by Licensor and\n          subsequently incorporated within the Work.\n\n       2. Grant of Copyright License. Subject to the terms and conditions of\n          this License, each Contributor hereby grants to You a perpetual,\n          worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n          copyright license to reproduce, prepare Derivative Works of,\n          publicly display, publicly perform, sublicense, and distribute the\n          Work and such Derivative Works in Source or Object form.\n\n       3. Grant of Patent License. Subject to the terms and conditions of\n          this License, each Contributor hereby grants to You a perpetual,\n          worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n          (except as stated in this section) patent license to make, have made,\n          use, offer to sell, sell, import, and otherwise transfer the Work,\n          where such license applies only to those patent claims licensable\n          by such Contributor that are necessarily infringed by their\n          Contribution(s) alone or by combination of their Contribution(s)\n          with the Work to which such Contribution(s) was submitted. If You\n          institute patent litigation against any entity (including a\n          cross-claim or counterclaim in a lawsuit) alleging that the Work\n          or a Contribution incorporated within the Work constitutes direct\n          or contributory patent infringement, then any patent licenses\n          granted to You under this License for that Work shall terminate\n          as of the date such litigation is filed.\n\n       4. Redistribution. You may reproduce and distribute copies of the\n          Work or Derivative Works thereof in any medium, with or without\n          modifications, and in Source or Object form, provided that You\n          meet the following conditions:\n\n          (a) You must give any other recipients of the Work or\n              Derivative Works a copy of this License; and\n\n          (b) You must cause any modified files to carry prominent notices\n              stating that You changed the files; and\n\n          (c) You must retain, in the Source form of any Derivative Works\n              that You distribute, all copyright, patent, trademark, and\n              attribution notices from the Source form of the Work,\n              excluding those notices that do not pertain to any part of\n              the Derivative Works; and\n\n          (d) If the Work includes a \"NOTICE\" text file as part of its\n              distribution, then any Derivative Works that You distribute must\n              include a readable copy of the attribution notices contained\n              within such NOTICE file, excluding those notices that do not\n              pertain to any part of the Derivative Works, in at least one\n              of the following places: within a NOTICE text file distributed\n              as part of the Derivative Works; within the Source form or\n              documentation, if provided along with the Derivative Works; or,\n              within a display generated by the Derivative Works, if and\n              wherever such third-party notices normally appear. The contents\n              of the NOTICE file are for informational purposes only and\n              do not modify the License. You may add Your own attribution\n              notices within Derivative Works that You distribute, alongside\n              or as an addendum to the NOTICE text from the Work, provided\n              that such additional attribution notices cannot be construed\n              as modifying the License.\n\n          You may add Your own copyright statement to Your modifications and\n          may provide additional or different license terms and conditions\n          for use, reproduction, or distribution of Your modifications, or\n          for any such Derivative Works as a whole, provided Your use,\n          reproduction, and distribution of the Work otherwise complies with\n          the conditions stated in this License.\n\n       5. Submission of Contributions. Unless You explicitly state otherwise,\n          any Contribution intentionally submitted for inclusion in the Work\n          by You to the Licensor shall be under the terms and conditions of\n          this License, without any additional terms or conditions.\n          Notwithstanding the above, nothing herein shall supersede or modify\n          the terms of any separate license agreement you may have executed\n          with Licensor regarding such Contributions.\n\n       6. Trademarks. This License does not grant permission to use the trade\n          names, trademarks, service marks, or product names of the Licensor,\n          except as required for reasonable and customary use in describing the\n          origin of the Work and reproducing the content of the NOTICE file.\n\n       7. Disclaimer of Warranty. Unless required by applicable law or\n          agreed to in writing, Licensor provides the Work (and each\n          Contributor provides its Contributions) on an \"AS IS\" BASIS,\n          WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n          implied, including, without limitation, any warranties or conditions\n          of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n          PARTICULAR PURPOSE. You are solely responsible for determining the\n          appropriateness of using or redistributing the Work and assume any\n          risks associated with Your exercise of permissions under this License.\n\n       8. Limitation of Liability. In no event and under no legal theory,\n          whether in tort (including negligence), contract, or otherwise,\n          unless required by applicable law (such as deliberate and grossly\n          negligent acts) or agreed to in writing, shall any Contributor be\n          liable to You for damages, including any direct, indirect, special,\n          incidental, or consequential damages of any character arising as a\n          result of this License or out of the use or inability to use the\n          Work (including but not limited to damages for loss of goodwill,\n          work stoppage, computer failure or malfunction, or any and all\n          other commercial damages or losses), even if such Contributor\n          has been advised of the possibility of such damages.\n\n       9. Accepting Warranty or Additional Liability. While redistributing\n          the Work or Derivative Works thereof, You may choose to offer,\n          and charge a fee for, acceptance of support, warranty, indemnity,\n          or other liability obligations and/or rights consistent with this\n          License. However, in accepting such obligations, You may act only\n          on Your own behalf and on Your sole responsibility, not on behalf\n          of any other Contributor, and only if You agree to indemnify,\n          defend, and hold each Contributor harmless for any liability\n          incurred by, or claims asserted against, such Contributor by reason\n          of your accepting any such warranty or additional liability.\n\n       END OF TERMS AND CONDITIONS\n\n       APPENDIX: How to apply the Apache License to your work.\n\n          To apply the Apache License to your work, attach the following\n          boilerplate notice, with the fields enclosed by brackets \"{}\"\n          replaced with your own identifying information. (Don't include\n          the brackets!)  The text should be enclosed in the appropriate\n          comment syntax for the file format. We also recommend that a\n          file or class name and description of purpose be included on the\n          same \"printed page\" as the copyright notice for easier\n          identification within third-party archives.\n\n       Copyright 2018-2025 The simdjson authors\n\n       Licensed under the Apache License, Version 2.0 (the \"License\");\n       you may not use this file except in compliance with the License.\n       You may obtain a copy of the License at\n\n           http://www.apache.org/licenses/LICENSE-2.0\n\n       Unless required by applicable law or agreed to in writing, software\n       distributed under the License is distributed on an \"AS IS\" BASIS,\n       WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n       See the License for the specific language governing permissions and\n       limitations under the License.\n  \"\"\"\n\n- simdutf, located at deps/v8/third_party/simdutf, is licensed as follows:\n  \"\"\"\n    Copyright 2021 The simdutf authors\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy of\n    this software and associated documentation files (the \"Software\"), to deal in\n    the Software without restriction, including without limitation the rights to\n    use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of\n    the Software, and to permit persons to whom the Software is furnished to do so,\n    subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in all\n    copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS\n    FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR\n    COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER\n    IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN\n    CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n  \"\"\"\n\n- ada, located at deps/ada, is licensed as follows:\n  \"\"\"\n    Copyright 2023 Yagiz Nizipli and Daniel Lemire\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy of\n    this software and associated documentation files (the \"Software\"), to deal in\n    the Software without restriction, including without limitation the rights to\n    use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of\n    the Software, and to permit persons to whom the Software is furnished to do so,\n    subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in all\n    copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS\n    FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR\n    COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER\n    IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN\n    CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n  \"\"\"\n\n- minimatch, located at deps/minimatch, is licensed as follows:\n  \"\"\"\n    The ISC License\n\n    Copyright (c) 2011-2023 Isaac Z. Schlueter and Contributors\n\n    Permission to use, copy, modify, and/or distribute this software for any\n    purpose with or without fee is hereby granted, provided that the above\n    copyright notice and this permission notice appear in all copies.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\" AND THE AUTHOR DISCLAIMS ALL WARRANTIES\n    WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF\n    MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR\n    ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\n    WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN\n    ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR\n    IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n  \"\"\"\n\n- npm, located at deps/npm, is licensed as follows:\n  \"\"\"\n    The npm application\n    Copyright (c) npm, Inc. and Contributors\n    Licensed on the terms of The Artistic License 2.0\n\n    Node package dependencies of the npm application\n    Copyright (c) their respective copyright owners\n    Licensed on their respective license terms\n\n    The npm public registry at https://registry.npmjs.org\n    and the npm website at https://www.npmjs.com\n    Operated by npm, Inc.\n    Use governed by terms published on https://www.npmjs.com\n\n    \"Node.js\"\n    Trademark Joyent, Inc., https://joyent.com\n    Neither npm nor npm, Inc. are affiliated with Joyent, Inc.\n\n    The Node.js application\n    Project of Node Foundation, https://nodejs.org\n\n    The npm Logo\n    Copyright (c) Mathias Pettersson and Brian Hammond\n\n    \"Gubblebum Blocky\" typeface\n    Copyright (c) Tjarda Koster, https://jelloween.deviantart.com\n    Used with permission\n\n    --------\n\n    The Artistic License 2.0\n\n    Copyright (c) 2000-2006, The Perl Foundation.\n\n    Everyone is permitted to copy and distribute verbatim copies\n    of this license document, but changing it is not allowed.\n\n    Preamble\n\n    This license establishes the terms under which a given free software\n    Package may be copied, modified, distributed, and/or redistributed.\n    The intent is that the Copyright Holder maintains some artistic\n    control over the development of that Package while still keeping the\n    Package available as open source and free software.\n\n    You are always permitted to make arrangements wholly outside of this\n    license directly with the Copyright Holder of a given Package.  If the\n    terms of this license do not permit the full use that you propose to\n    make of the Package, you should contact the Copyright Holder and seek\n    a different licensing arrangement.\n\n    Definitions\n\n        \"Copyright Holder\" means the individual(s) or organization(s)\n        named in the copyright notice for the entire Package.\n\n        \"Contributor\" means any party that has contributed code or other\n        material to the Package, in accordance with the Copyright Holder's\n        procedures.\n\n        \"You\" and \"your\" means any person who would like to copy,\n        distribute, or modify the Package.\n\n        \"Package\" means the collection of files distributed by the\n        Copyright Holder, and derivatives of that collection and/or of\n        those files. A given Package may consist of either the Standard\n        Version, or a Modified Version.\n\n        \"Distribute\" means providing a copy of the Package or making it\n        accessible to anyone else, or in the case of a company or\n        organization, to others outside of your company or organization.\n\n        \"Distributor Fee\" means any fee that you charge for Distributing\n        this Package or providing support for this Package to another\n        party.  It does not mean licensing fees.\n\n        \"Standard Version\" refers to the Package if it has not been\n        modified, or has been modified only in ways explicitly requested\n        by the Copyright Holder.\n\n        \"Modified Version\" means the Package, if it has been changed, and\n        such changes were not explicitly requested by the Copyright\n        Holder.\n\n        \"Original License\" means this Artistic License as Distributed with\n        the Standard Version of the Package, in its current version or as\n        it may be modified by The Perl Foundation in the future.\n\n        \"Source\" form means the source code, documentation source, and\n        configuration files for the Package.\n\n        \"Compiled\" form means the compiled bytecode, object code, binary,\n        or any other form resulting from mechanical transformation or\n        translation of the Source form.\n\n    Permission for Use and Modification Without Distribution\n\n    (1)  You are permitted to use the Standard Version and create and use\n    Modified Versions for any purpose without restriction, provided that\n    you do not Distribute the Modified Version.\n\n    Permissions for Redistribution of the Standard Version\n\n    (2)  You may Distribute verbatim copies of the Source form of the\n    Standard Version of this Package in any medium without restriction,\n    either gratis or for a Distributor Fee, provided that you duplicate\n    all of the original copyright notices and associated disclaimers.  At\n    your discretion, such verbatim copies may or may not include a\n    Compiled form of the Package.\n\n    (3)  You may apply any bug fixes, portability changes, and other\n    modifications made available from the Copyright Holder.  The resulting\n    Package will still be considered the Standard Version, and as such\n    will be subject to the Original License.\n\n    Distribution of Modified Versions of the Package as Source\n\n    (4)  You may Distribute your Modified Version as Source (either gratis\n    or for a Distributor Fee, and with or without a Compiled form of the\n    Modified Version) provided that you clearly document how it differs\n    from the Standard Version, including, but not limited to, documenting\n    any non-standard features, executables, or modules, and provided that\n    you do at least ONE of the following:\n\n        (a)  make the Modified Version available to the Copyright Holder\n        of the Standard Version, under the Original License, so that the\n        Copyright Holder may include your modifications in the Standard\n        Version.\n\n        (b)  ensure that installation of your Modified Version does not\n        prevent the user installing or running the Standard Version. In\n        addition, the Modified Version must bear a name that is different\n        from the name of the Standard Version.\n\n        (c)  allow anyone who receives a copy of the Modified Version to\n        make the Source form of the Modified Version available to others\n        under\n\n            (i)  the Original License or\n\n            (ii)  a license that permits the licensee to freely copy,\n            modify and redistribute the Modified Version using the same\n            licensing terms that apply to the copy that the licensee\n            received, and requires that the Source form of the Modified\n            Version, and of any works derived from it, be made freely\n            available in that license fees are prohibited but Distributor\n            Fees are allowed.\n\n    Distribution of Compiled Forms of the Standard Version\n    or Modified Versions without the Source\n\n    (5)  You may Distribute Compiled forms of the Standard Version without\n    the Source, provided that you include complete instructions on how to\n    get the Source of the Standard Version.  Such instructions must be\n    valid at the time of your distribution.  If these instructions, at any\n    time while you are carrying out such distribution, become invalid, you\n    must provide new instructions on demand or cease further distribution.\n    If you provide valid instructions or cease distribution within thirty\n    days after you become aware that the instructions are invalid, then\n    you do not forfeit any of your rights under this license.\n\n    (6)  You may Distribute a Modified Version in Compiled form without\n    the Source, provided that you comply with Section 4 with respect to\n    the Source of the Modified Version.\n\n    Aggregating or Linking the Package\n\n    (7)  You may aggregate the Package (either the Standard Version or\n    Modified Version) with other packages and Distribute the resulting\n    aggregation provided that you do not charge a licensing fee for the\n    Package.  Distributor Fees are permitted, and licensing fees for other\n    components in the aggregation are permitted. The terms of this license\n    apply to the use and Distribution of the Standard or Modified Versions\n    as included in the aggregation.\n\n    (8) You are permitted to link Modified and Standard Versions with\n    other works, to embed the Package in a larger work of your own, or to\n    build stand-alone binary or bytecode versions of applications that\n    include the Package, and Distribute the result without restriction,\n    provided the result does not expose a direct interface to the Package.\n\n    Items That are Not Considered Part of a Modified Version\n\n    (9) Works (including, but not limited to, modules and scripts) that\n    merely extend or make use of the Package, do not, by themselves, cause\n    the Package to be a Modified Version.  In addition, such works are not\n    considered parts of the Package itself, and are not subject to the\n    terms of this license.\n\n    General Provisions\n\n    (10)  Any use, modification, and distribution of the Standard or\n    Modified Versions is governed by this Artistic License. By using,\n    modifying or distributing the Package, you accept this license. Do not\n    use, modify, or distribute the Package, if you do not accept this\n    license.\n\n    (11)  If your Modified Version has been derived from a Modified\n    Version made by someone other than you, you are nevertheless required\n    to ensure that your Modified Version complies with the requirements of\n    this license.\n\n    (12)  This license does not grant you the right to use any trademark,\n    service mark, tradename, or logo of the Copyright Holder.\n\n    (13)  This license includes the non-exclusive, worldwide,\n    free-of-charge patent license to make, have made, use, offer to sell,\n    sell, import and otherwise transfer the Package with respect to any\n    patent claims licensable by the Copyright Holder that are necessarily\n    infringed by the Package. If you institute patent litigation\n    (including a cross-claim or counterclaim) against any party alleging\n    that the Package constitutes direct or contributory patent\n    infringement, then this Artistic License to you shall terminate on the\n    date that such litigation is filed.\n\n    (14)  Disclaimer of Warranty:\n    THE PACKAGE IS PROVIDED BY THE COPYRIGHT HOLDER AND CONTRIBUTORS \"AS\n    IS' AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES. THE IMPLIED\n    WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR\n    NON-INFRINGEMENT ARE DISCLAIMED TO THE EXTENT PERMITTED BY YOUR LOCAL\n    LAW. UNLESS REQUIRED BY LAW, NO COPYRIGHT HOLDER OR CONTRIBUTOR WILL\n    BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL\n    DAMAGES ARISING IN ANY WAY OUT OF THE USE OF THE PACKAGE, EVEN IF\n    ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n    --------\n  \"\"\"\n\n- GYP, located at tools/gyp, is licensed as follows:\n  \"\"\"\n    Copyright (c) 2020 Node.js contributors. All rights reserved.\n    Copyright (c) 2009 Google Inc. All rights reserved.\n\n    Redistribution and use in source and binary forms, with or without\n    modification, are permitted provided that the following conditions are\n    met:\n\n       * Redistributions of source code must retain the above copyright\n    notice, this list of conditions and the following disclaimer.\n       * Redistributions in binary form must reproduce the above\n    copyright notice, this list of conditions and the following disclaimer\n    in the documentation and/or other materials provided with the\n    distribution.\n       * Neither the name of Google Inc. nor the names of its\n    contributors may be used to endorse or promote products derived from\n    this software without specific prior written permission.\n\n    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n    \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n    LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n    A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n    OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n    LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n    DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n    THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n  \"\"\"\n\n- inspector_protocol, located at deps/inspector_protocol, is licensed as follows:\n  \"\"\"\n    // Copyright 2016 The Chromium Authors.\n    //\n    // Redistribution and use in source and binary forms, with or without\n    // modification, are permitted provided that the following conditions are\n    // met:\n    //\n    //    * Redistributions of source code must retain the above copyright\n    // notice, this list of conditions and the following disclaimer.\n    //    * Redistributions in binary form must reproduce the above\n    // copyright notice, this list of conditions and the following disclaimer\n    // in the documentation and/or other materials provided with the\n    // distribution.\n    //    * Neither the name of Google Inc. nor the names of its\n    // contributors may be used to endorse or promote products derived from\n    // this software without specific prior written permission.\n    //\n    // THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n    // \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n    // LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n    // A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n    // OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n    // SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n    // LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n    // DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n    // THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n    // (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n    // OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n  \"\"\"\n\n- jinja2, located at tools/inspector_protocol/jinja2, is licensed as follows:\n  \"\"\"\n    Copyright (c) 2009 by the Jinja Team, see AUTHORS for more details.\n\n    Some rights reserved.\n\n    Redistribution and use in source and binary forms, with or without\n    modification, are permitted provided that the following conditions are\n    met:\n\n        * Redistributions of source code must retain the above copyright\n          notice, this list of conditions and the following disclaimer.\n\n        * Redistributions in binary form must reproduce the above\n          copyright notice, this list of conditions and the following\n          disclaimer in the documentation and/or other materials provided\n          with the distribution.\n\n        * The names of the contributors may not be used to endorse or\n          promote products derived from this software without specific\n          prior written permission.\n\n    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n    \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n    LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n    A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n    OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n    LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n    DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n    THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n  \"\"\"\n\n- markupsafe, located at tools/inspector_protocol/markupsafe, is licensed as follows:\n  \"\"\"\n    Copyright (c) 2010 by Armin Ronacher and contributors.  See AUTHORS\n    for more details.\n\n    Some rights reserved.\n\n    Redistribution and use in source and binary forms of the software as well\n    as documentation, with or without modification, are permitted provided\n    that the following conditions are met:\n\n    * Redistributions of source code must retain the above copyright\n      notice, this list of conditions and the following disclaimer.\n\n    * Redistributions in binary form must reproduce the above\n      copyright notice, this list of conditions and the following\n      disclaimer in the documentation and/or other materials provided\n      with the distribution.\n\n    * The names of the contributors may not be used to endorse or\n      promote products derived from this software without specific\n      prior written permission.\n\n    THIS SOFTWARE AND DOCUMENTATION IS PROVIDED BY THE COPYRIGHT HOLDERS AND\n    CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT\n    NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n    A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER\n    OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\n    EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\n    PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\n    PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\n    LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\n    NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\n    SOFTWARE AND DOCUMENTATION, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH\n    DAMAGE.\n  \"\"\"\n\n- cpplint.py, located at tools/cpplint.py, is licensed as follows:\n  \"\"\"\n    Copyright (c) 2009 Google Inc. All rights reserved.\n\n    Redistribution and use in source and binary forms, with or without\n    modification, are permitted provided that the following conditions are\n    met:\n\n       * Redistributions of source code must retain the above copyright\n    notice, this list of conditions and the following disclaimer.\n       * Redistributions in binary form must reproduce the above\n    copyright notice, this list of conditions and the following disclaimer\n    in the documentation and/or other materials provided with the\n    distribution.\n       * Neither the name of Google Inc. nor the names of its\n    contributors may be used to endorse or promote products derived from\n    this software without specific prior written permission.\n\n    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n    \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n    LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n    A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n    OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n    LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n    DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n    THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n  \"\"\"\n\n- gypi_to_gn.py, located at tools/gypi_to_gn.py, is licensed as follows:\n  \"\"\"\n    Redistribution and use in source and binary forms, with or without\n    modification, are permitted provided that the following conditions are\n    met:\n\n       * Redistributions of source code must retain the above copyright\n    notice, this list of conditions and the following disclaimer.\n       * Redistributions in binary form must reproduce the above\n    copyright notice, this list of conditions and the following disclaimer\n    in the documentation and/or other materials provided with the\n    distribution.\n       * Neither the name of Google LLC nor the names of its\n    contributors may be used to endorse or promote products derived from\n    this software without specific prior written permission.\n\n    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n    \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n    LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n    A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n    OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n    LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n    DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n    THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n  \"\"\"\n\n- gtest, located at deps/googletest, is licensed as follows:\n  \"\"\"\n    Copyright 2008, Google Inc.\n    All rights reserved.\n\n    Redistribution and use in source and binary forms, with or without\n    modification, are permitted provided that the following conditions are\n    met:\n\n        * Redistributions of source code must retain the above copyright\n    notice, this list of conditions and the following disclaimer.\n        * Redistributions in binary form must reproduce the above\n    copyright notice, this list of conditions and the following disclaimer\n    in the documentation and/or other materials provided with the\n    distribution.\n        * Neither the name of Google Inc. nor the names of its\n    contributors may be used to endorse or promote products derived from\n    this software without specific prior written permission.\n\n    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n    \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n    LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n    A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n    OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n    LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n    DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n    THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n  \"\"\"\n\n- nghttp2, located at deps/nghttp2, is licensed as follows:\n  \"\"\"\n    The MIT License\n\n    Copyright (c) 2012, 2014, 2015, 2016 Tatsuhiro Tsujikawa\n    Copyright (c) 2012, 2014, 2015, 2016 nghttp2 contributors\n\n    Permission is hereby granted, free of charge, to any person obtaining\n    a copy of this software and associated documentation files (the\n    \"Software\"), to deal in the Software without restriction, including\n    without limitation the rights to use, copy, modify, merge, publish,\n    distribute, sublicense, and/or sell copies of the Software, and to\n    permit persons to whom the Software is furnished to do so, subject to\n    the following conditions:\n\n    The above copyright notice and this permission notice shall be\n    included in all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\n    EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n    MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n    NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE\n    LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\n    OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\n    WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n  \"\"\"\n\n- large_pages, located at src/large_pages, is licensed as follows:\n  \"\"\"\n     Copyright (C) 2018 Intel Corporation\n\n     Permission is hereby granted, free of charge, to any person obtaining a copy\n     of this software and associated documentation files (the \"Software\"),\n     to deal in the Software without restriction, including without limitation\n     the rights to use, copy, modify, merge, publish, distribute, sublicense,\n     and/or sell copies of the Software, and to permit persons to whom\n     the Software is furnished to do so, subject to the following conditions:\n\n     The above copyright notice and this permission notice shall be included\n     in all copies or substantial portions of the Software.\n\n     THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\n     OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n     FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL\n     THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES\n     OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,\n     ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE\n     OR OTHER DEALINGS IN THE SOFTWARE.\n  \"\"\"\n\n- caja, located at lib/internal/freeze_intrinsics.js, is licensed as follows:\n  \"\"\"\n     Adapted from SES/Caja - Copyright (C) 2011 Google Inc.\n     Copyright (C) 2018 Agoric\n\n     Licensed under the Apache License, Version 2.0 (the \"License\");\n     you may not use this file except in compliance with the License.\n     You may obtain a copy of the License at\n\n     http://www.apache.org/licenses/LICENSE-2.0\n\n     Unless required by applicable law or agreed to in writing, software\n     distributed under the License is distributed on an \"AS IS\" BASIS,\n     WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n     See the License for the specific language governing permissions and\n     limitations under the License.\n  \"\"\"\n\n- brotli, located at deps/brotli, is licensed as follows:\n  \"\"\"\n    Copyright (c) 2009, 2010, 2013-2016 by the Brotli Authors.\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy\n    of this software and associated documentation files (the \"Software\"), to deal\n    in the Software without restriction, including without limitation the rights\n    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n    copies of the Software, and to permit persons to whom the Software is\n    furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in\n    all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\n    THE SOFTWARE.\n  \"\"\"\n\n- zstd, located at deps/zstd, is licensed as follows:\n  \"\"\"\n    BSD License\n\n    For Zstandard software\n\n    Copyright (c) Meta Platforms, Inc. and affiliates. All rights reserved.\n\n    Redistribution and use in source and binary forms, with or without modification,\n    are permitted provided that the following conditions are met:\n\n     * Redistributions of source code must retain the above copyright notice, this\n       list of conditions and the following disclaimer.\n\n     * Redistributions in binary form must reproduce the above copyright notice,\n       this list of conditions and the following disclaimer in the documentation\n       and/or other materials provided with the distribution.\n\n     * Neither the name Facebook, nor Meta, nor the names of its contributors may\n       be used to endorse or promote products derived from this software without\n       specific prior written permission.\n\n    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\n    ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\n    WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR\n    ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n    (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\n    LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\n    ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\n    SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n  \"\"\"\n\n- HdrHistogram, located at deps/histogram, is licensed as follows:\n  \"\"\"\n    The code in this repository code was Written by Gil Tene, Michael Barker,\n    and Matt Warren, and released to the public domain, as explained at\n    http://creativecommons.org/publicdomain/zero/1.0/\n\n    For users of this code who wish to consume it under the \"BSD\" license\n    rather than under the public domain or CC0 contribution text mentioned\n    above, the code found under this directory is *also* provided under the\n    following license (commonly referred to as the BSD 2-Clause License). This\n    license does not detract from the above stated release of the code into\n    the public domain, and simply represents an additional license granted by\n    the Author.\n\n    -----------------------------------------------------------------------------\n    ** Beginning of \"BSD 2-Clause License\" text. **\n\n     Copyright (c) 2012, 2013, 2014 Gil Tene\n     Copyright (c) 2014 Michael Barker\n     Copyright (c) 2014 Matt Warren\n     All rights reserved.\n\n     Redistribution and use in source and binary forms, with or without\n     modification, are permitted provided that the following conditions are met:\n\n     1. Redistributions of source code must retain the above copyright notice,\n        this list of conditions and the following disclaimer.\n\n     2. Redistributions in binary form must reproduce the above copyright notice,\n        this list of conditions and the following disclaimer in the documentation\n        and/or other materials provided with the distribution.\n\n     THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\n     AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n     IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n     ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE\n     LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n     CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\n     SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n     INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n     CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n     ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF\n     THE POSSIBILITY OF SUCH DAMAGE.\n  \"\"\"\n\n- node-heapdump, located at src/heap_utils.cc, is licensed as follows:\n  \"\"\"\n    ISC License\n\n    Copyright (c) 2012, Ben Noordhuis <info@bnoordhuis.nl>\n\n    Permission to use, copy, modify, and/or distribute this software for any\n    purpose with or without fee is hereby granted, provided that the above\n    copyright notice and this permission notice appear in all copies.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\" AND THE AUTHOR DISCLAIMS ALL WARRANTIES\n    WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF\n    MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR\n    ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\n    WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN\n    ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF\n    OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n\n    === src/compat.h src/compat-inl.h ===\n\n    ISC License\n\n    Copyright (c) 2014, StrongLoop Inc.\n\n    Permission to use, copy, modify, and/or distribute this software for any\n    purpose with or without fee is hereby granted, provided that the above\n    copyright notice and this permission notice appear in all copies.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\" AND THE AUTHOR DISCLAIMS ALL WARRANTIES\n    WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF\n    MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR\n    ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\n    WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN\n    ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF\n    OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n  \"\"\"\n\n- rimraf, located at lib/internal/fs/rimraf.js, is licensed as follows:\n  \"\"\"\n    The ISC License\n\n    Copyright (c) Isaac Z. Schlueter and Contributors\n\n    Permission to use, copy, modify, and/or distribute this software for any\n    purpose with or without fee is hereby granted, provided that the above\n    copyright notice and this permission notice appear in all copies.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\" AND THE AUTHOR DISCLAIMS ALL WARRANTIES\n    WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF\n    MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR\n    ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\n    WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN\n    ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR\n    IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n  \"\"\"\n\n- uvwasi, located at deps/uvwasi, is licensed as follows:\n  \"\"\"\n    MIT License\n\n    Copyright (c) 2019 Colin Ihrig and Contributors\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy\n    of this software and associated documentation files (the \"Software\"), to deal\n    in the Software without restriction, including without limitation the rights\n    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n    copies of the Software, and to permit persons to whom the Software is\n    furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in all\n    copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n    SOFTWARE.\n  \"\"\"\n\n- ngtcp2, located at deps/ngtcp2/ngtcp2/, is licensed as follows:\n  \"\"\"\n    The MIT License\n\n    Copyright (c) 2016 ngtcp2 contributors\n\n    Permission is hereby granted, free of charge, to any person obtaining\n    a copy of this software and associated documentation files (the\n    \"Software\"), to deal in the Software without restriction, including\n    without limitation the rights to use, copy, modify, merge, publish,\n    distribute, sublicense, and/or sell copies of the Software, and to\n    permit persons to whom the Software is furnished to do so, subject to\n    the following conditions:\n\n    The above copyright notice and this permission notice shall be\n    included in all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\n    EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n    MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n    NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE\n    LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\n    OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\n    WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n  \"\"\"\n\n- nghttp3, located at deps/ngtcp2/nghttp3/, is licensed as follows:\n  \"\"\"\n    The MIT License\n\n    Copyright (c) 2019 nghttp3 contributors\n\n    Permission is hereby granted, free of charge, to any person obtaining\n    a copy of this software and associated documentation files (the\n    \"Software\"), to deal in the Software without restriction, including\n    without limitation the rights to use, copy, modify, merge, publish,\n    distribute, sublicense, and/or sell copies of the Software, and to\n    permit persons to whom the Software is furnished to do so, subject to\n    the following conditions:\n\n    The above copyright notice and this permission notice shall be\n    included in all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\n    EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n    MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n    NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE\n    LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\n    OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\n    WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n  \"\"\"\n\n- node-fs-extra, located at lib/internal/fs/cp, is licensed as follows:\n  \"\"\"\n    (The MIT License)\n\n    Copyright (c) 2011-2017 JP Richardson\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files\n    (the 'Software'), to deal in the Software without restriction, including without limitation the rights to use, copy, modify,\n     merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is\n     furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED 'AS IS', WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE\n    WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS\n    OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,\n     ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n  \"\"\"\n\n- on-exit-leak-free, located at lib/internal/process/finalization, is licensed as follows:\n  \"\"\"\n    MIT License\n\n    Copyright (c) 2021 Matteo Collina\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy\n    of this software and associated documentation files (the \"Software\"), to deal\n    in the Software without restriction, including without limitation the rights\n    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n    copies of the Software, and to permit persons to whom the Software is\n    furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in all\n    copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n    SOFTWARE.\n  \"\"\"\n\n- sonic-boom, located at lib/internal/streams/fast-utf8-stream.js, is licensed as follows:\n  \"\"\"\n    MIT License\n\n    Copyright (c) 2017 Matteo Collina\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy\n    of this software and associated documentation files (the \"Software\"), to deal\n    in the Software without restriction, including without limitation the rights\n    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n    copies of the Software, and to permit persons to whom the Software is\n    furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in all\n    copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n    SOFTWARE.\n  \"\"\""
    }
}
